print ('\nПрограмма для решения квадратного уравнения "ax\u00b2 + bx + c = 0"')

a = float (input ("\nВведите коэффициент 'a' = "))
print ("\nВы ввели", a)

b = float (input ("\nВведите коэффициент 'b' = "))
print ("\nВы ввели", b)

c = float (input ("\nВведите коэффициент 'c' = "))
print ("\nВы ввели", c)

D = b**2 - 4*a*c

if D > 0:
    x1 = (-b + D**0.5) / (2*a)
    x2 = (-b - D**0.5) / (2*a)
    print("\nКорни уравнения:", "\nx\u2081 =", x1, "\nx\u2082 =", x2)
elif D == 0:
    x = -b / (2 * a)
    print ("\nКорень уравнения:", x)
else:
    print ("\nКорней нет")

input("\nДля выхода нажмите 'Enter'")

